namespace JishilouFourthFloor;

internal static class Data
{
    public sealed record Tag(string Key, string Value, string? Display = null);

    public sealed record RoomInfo(double Longitude, double Latitude, IReadOnlyList<Tag> Tags);

    public static IReadOnlyDictionary<string, RoomInfo> Rooms { get; } = new Dictionary<string, RoomInfo>()
    {
        ["407"] = new(121.20973290167655, 31.283589126638276,
        [
            new("部门", "研究生工作室"),
            new("实验中心负责人", "陈梁", "陈梁（电话：69589847）"),
            new("实验室安全负责人", "严海洲", "严海洲（电话：13918378240）"),
            new("实验室安全员", "叶珂男")
        ]),
        ["408R"] = new(121.20959402987563, 31.28347981522286,
        [
            new("部门", "研究生工作室")
        ]),
        ["409L"] = new(121.20957210274815, 31.283689068392476,
        [
            new("部门", "研究生工作室"),
            new("实验中心负责人", "陈梁", "陈梁（电话：69589847）"),
            new("实验室安全负责人", "朱亚萍", "朱亚萍（电话：15195975598）"),
            new("实验室安全员", "代玉琢")
        ]),
        ["409R"] = new(121.2096598112546, 31.283635974348712,
        [
            new("部门", "研究生工作室"),
            new("实验中心负责人", "陈梁", "陈梁（电话：69589847）"),
            new("实验室安全负责人", "杜庆峰", "杜庆峰（电话：189648066069）"),
            new("实验室安全员", "韩永琦")
        ]),
        ["410"] = new(121.20952093945368, 31.283551648452843,
        [
            new("部门", "教研室"),
            new("老师", "王冬青"),
            new("老师", "李江峰"),
            new("老师", "夏波涌"),
            new("老师", "张颖"),
        ]),
        ["412L"] = new(121.20942226738526, 31.28362348162807,
        [
            new("部门", "教研室"),
            new("老师", "刘岩"),
            new("老师", "张惠娟"),
            new("老师", "孙萍"),
            new("老师", "罗怡桂"),
        ]),
        ["414"] = new(121.20933455887894, 31.283835857652633,
        [
            new("部门", "教室"),
        ]),
        ["416"] = new(121.20934186792022, 31.283929552805134,
        [
            new("部门", "教学机房"),
            new("实验中心负责人", "陈梁"),
            new("实验室安全负责人", "杨旻"),
        ]),
        ["417"] = new(121.20950997588994, 31.283954538163584,
        [
            new("部门", "会议室"),
        ]),
        ["418L"] = new(121.20933090435824, 31.28399201618886,
        [
            new("部门", "教授办公室"),
            new("老师", "张林"),
            new("老师", "江建慧"),
            new("老师", "刘琴"),
        ]),
        ["418R"] = new(121.20933329873185, 31.28404456668615,
        [
            new("部门", "研究生工作室"),
            new("课题组负责人", "袁时金"),
            new("安全责任人", "袁时金"),
        ]),
        ["419"] = new(121.20951363041235, 31.284017001530785,
        [
            new("部门", "教学实验室"),
            new("实验中心负责人", "陈梁"),
            new("实验室安全负责人", "张晶（电话：13916133163）"),
        ]),
        ["426"] = new(121.20944419579558, 31.284210637305065,
        [
            new("部门", "多媒体教学机房"),
            new("课题组负责人", "杨旻"),
            new("安全责任人", "严海洲"),
        ]),
        ["428"] = new(121.20950632265385, 31.284207514144455,
        [
            new("部门", "服务器机房"),
            new("课题组负责人", "杨旻"),
            new("安全责任人", "严海洲"),
        ]),
        ["430"] = new(121.20966323417366, 31.284213972002277,
        [
            new("部门", "教学机房"),
            new("实验中心负责人", "陈梁"),
            new("实验室安全负责人", "杨旻"),
        ]),
        ["432"] = new(121.20983333942974, 31.284211664506003,
        [
            new("部门", "党员之家"),
        ]),
        ["434"] = new(121.2096598112546, 31.283635974348712,
        [
            new("部门", "教室"),
        ]),
        ["441"] = new(121.20999602848025, 31.284026370632304,
        [
            new("部门", "会议室"),
        ]),
        ["442L"] = new(121.2098096479038, 31.284029493798897,
        [
            new("部门", "教务办公室"),
            new("老师", "刘梦露"),
            new("老师", "李慧敏"),
            new("老师", "王彩霞"),
            new("老师", "杨丹"),
            new("老师", "姚仕仪"),
        ]),
        ["442R"] = new(121.20980633859466, 31.284061677108397,
        [
            new("部门", "学院办公室"),
            new("老师", "闫鹏"),
            new("老师", "张晶"),
            new("老师", "林伊凡"),
            new("老师", "张晓雅"),
            new("老师", "钱银飞"),
            new("老师", "王昊榕"),
            new("老师", "俞晓静"),
        ]),
        ["443"] = new(121.2099923739579, 31.28395453776396,
        [
            new("部门", "实验中心"),
            new("老师", "陈梁"),
            new("老师", "杨旻"),
            new("老师", "严海洲"),
        ]),
        ["444"] = new(121.2098133024262, 31.28395766093294,
        [
            new("部门", "档案室"),
        ]),
        ["446"] = new(121.20984253859325, 31.283879581668728,
        [
            new("部门", "学生工作办公室"),
            new("老师", "张砚秋"),
            new("老师", "丁瑞庭"),
            new("老师", "葛蕾"),
            new("老师", "焦嘉欣"),
            new("老师", "钟梦莹"),
            new("老师", "陈璞皎"),
        ]),
        ["448-1"] = new(121.20994310725052, 31.283775392882475,
        [
            new("部门", "副书记办公室"),
            new("老师", "陈荣"),
        ]),
        ["448-2"] = new(121.2099229380583, 31.28378588646582,
        [
            new("部门", "副书记办公室"),
            new("老师", "吴晓培"),
        ]),
        ["448-3"] = new(121.20990557986602, 31.28380122795076,
        [
            new("部门", "院务助理办公室"),
            new("老师", "宋井宽"),
        ]),
        ["450L"] = new(121.21002161012666, 31.28371717659195,
        [
            new("部门", "党委书记办公室"),
            new("老师", "熊岚"),
        ]),
        ["450R"] = new(121.21005519969043, 31.2836998077605,
        [
            new("部门", "院长办公室"), 
            new("老师", "申恒涛")
        ]),
        ["451-1"] = new(121.21013282902572, 31.283820826963833,
        [
            new("部门", "副院长办公室"),
            new("老师", "王成"),
        ]),
        ["451-2"] = new(121.21012028219684, 31.283826487732213,
        [
            new("部门", "副院长办公室"),
            new("老师", "何良华"),
        ]),
        ["451-3"] = new(121.21010676834192, 31.283834189925585,
        [
            new("部门", "副院长办公室"),
            new("老师", "张林"),
        ]),
        ["455"] = new(121.21025549947706, 31.28374216200666,
        [
            new("部门", "会议室"),
        ]),
        ["456"] = new(121.21020213287517, 31.28366151111453,
        [
            new("部门", "党委办公室"),
            new("老师", "周微微"),
            new("老师", "陆凤兰"),
            new("老师", "赵清理"),
        ]),
    };
}